[
  {
    "level": "A1",
    "id": "a1_01",
    "title": "Morning routine",
    "text": "I wake up at seven o’clock every morning. First, I open the window and look outside. The sun is rising and the air feels fresh. I make my bed and then I go to the bathroom. I brush my teeth slowly and wash my face with cold water. It makes me feel awake. After that, I comb my hair and put on my clothes for work. I go to the kitchen and prepare breakfast. I drink a cup of coffee and eat some bread with butter. Sometimes I eat fruit, like a banana or an apple. I sit at the table and enjoy my breakfast while I listen to the radio. At eight o’clock, I take my bag and put on my shoes. I leave the house and walk to the bus stop. The street is quiet, and I can hear the birds singing. I take the bus to work and start my day.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_02",
    "title": "At the supermarket",
    "text": "Maria goes to the supermarket on Saturday morning. She takes a small shopping list from her bag and walks inside. First, she gets a shopping cart and goes to the dairy section. She buys a bottle of milk and a box of eggs. Then she goes to the fruit section and chooses some red apples. She also takes some bread and a bottle of water. Maria walks to the counter and waits in line. The cashier smiles and says hello. Maria pays for the food, puts everything in a bag, and thanks the cashier. She leaves the supermarket, walks to the bus stop, and takes a bus home. On the bus, she looks at the bag and feels happy with her shopping.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_03",
    "title": "At the park",
    "text": "John goes to the park in the afternoon. He walks on the path and sees many green trees. He sits on a bench and reads a book. Some children play with a ball near him. John drinks water from his bottle and watches the birds in the sky. After one hour, he closes his book, stands up, and walks home.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_04",
    "title": "In the kitchen",
    "text": "Anna is in the kitchen. She wants to make lunch. First, she washes her hands. She cuts some tomatoes and lettuce for a salad. She puts the vegetables in a bowl and adds some salt. Then she cooks rice in a pot. While the rice is cooking, she makes a cup of tea. After twenty minutes, the lunch is ready. Anna puts the food on the table and sits down to eat.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_05",
    "title": "At the library",
    "text": "Emma goes to the library on Wednesday afternoon. She opens the door quietly because the library is very silent. First, she walks to the front desk and says hello to the librarian. She asks for a book about history. The librarian shows her the right shelf. Emma looks at many books and chooses two. She takes them to a table and starts reading. She likes the soft light and the smell of the books. After one hour, she closes the books, goes back to the front desk, and borrows them. She thanks the librarian, puts the books in her bag, and leaves the library. Outside, the sun is shining and she feels happy to have new books to read at home.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_06",
    "title": "Going to school",
    "text": "Tom wakes up at half past six in the morning. He gets dressed and eats breakfast with his family. He puts his books, notebooks, and pencils into his school bag. At seven o’clock, he leaves the house and walks to the bus stop. The bus arrives, and Tom greets the driver. On the way to school, he talks with his friends about the homework. When he arrives at school, he goes to his classroom and sits at his desk. The teacher comes in and says good morning. Tom listens carefully during the lesson and writes in his notebook. At ten o’clock, it is break time. He goes to the school yard, eats a sandwich, and plays football with his classmates. After the break, he returns to class and continues studying until school finishes.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_07",
    "title": "At the restaurant",
    "text": "Lucy and her friend go to a restaurant for lunch. They walk inside and a waiter greets them with a smile. The waiter shows them a table near the window. They sit down and look at the menu. Lucy chooses chicken with rice, and her friend orders pasta with tomato sauce. They both order orange juice to drink. While they wait for the food, they talk about their day. The waiter brings the drinks first, and they enjoy them. After a few minutes, the food arrives. It smells delicious. They eat slowly and talk. When they finish, the waiter brings the bill. Lucy takes out her wallet, pays for the food, and leaves a small tip. They say goodbye to the waiter and walk outside into the warm afternoon.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_08",
    "title": "Cleaning the house",
    "text": "On Saturday morning, Mark decides to clean his house. He starts in the living room by picking up books and putting them on the shelf. He uses a cloth to clean the table and a vacuum cleaner to clean the carpet. Then he goes to the kitchen. He washes the dishes and puts them away. He cleans the stove and wipes the counters. After that, he goes to the bedroom. He makes the bed and changes the sheets. He opens the window to let in fresh air. Finally, he cleans the bathroom by washing the sink and the mirror. When everything is clean, he sits on the sofa with a cup of tea and feels proud of his work.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_09",
    "title": "Taking the train",
    "text": "Sophie needs to visit her grandmother in another town. In the morning, she packs a small bag with clothes and a book to read. She walks to the train station and buys a ticket. She waits on the platform and looks at the big clock on the wall. The train arrives, and Sophie gets on. She finds a seat near the window. The train starts moving, and she watches the houses, trees, and fields pass by. She reads her book for a while and then eats a small snack. After one hour, the train stops at her grandmother’s town. Sophie gets off, takes her bag, and walks out of the station. She sees her grandmother waiting and runs to give her a big hug.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A1",
    "id": "a1_10",
    "title": "A rainy day",
    "text": "It is raining outside, and Peter stays at home. He puts on warm clothes and makes a cup of hot chocolate. He sits by the window and listens to the sound of the rain. The street is empty, and the sky is gray. Peter takes a book from the shelf and starts reading. After some time, he feels hungry and goes to the kitchen. He makes a sandwich and eats it while watching the rain. In the afternoon, the rain becomes lighter. Peter puts on his raincoat, takes an umbrella, and walks to the small shop near his house to buy some bread. He comes back home, changes his wet shoes, and sits on the sofa. In the evening, the rain stops, and Peter opens the window to enjoy the fresh air.",
    "source": "internal",
    "lang": "en"
  }
  
  
  
  
  
  
  
  
  
  
]

