[
  {
    "level": "A2",
    "id": "a2_01",
    "title": "Daily commute",
    "text": "Every morning, Carla wakes up early, gets dressed, and leaves her apartment to go to work. She walks to the subway station, which is only five minutes from her home. The air is usually fresh, and she enjoys the short walk. At the station, she buys a coffee from a small shop and waits for the train. When the subway arrives, she gets on and finds a place to stand because it is often crowded with other passengers. Carla usually reads a book during the ride, turning the pages slowly and enjoying the story. Sometimes she listens to music instead, especially when she feels tired. The train moves quickly through the tunnels, stopping at different stations. She often sees familiar faces, people who also take the same train every day. The trip is short, and after about fifteen minutes, she arrives at her stop. She leaves the subway, walks up the stairs, and continues her journey to the office.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_02",
    "title": "Weekend plans",
    "text": "On Saturdays, we usually visit our grandparents, who live in a small house outside the city. We take the bus in the morning and enjoy the view of the countryside along the way. When we arrive, our grandparents greet us warmly and invite us inside. We spend some time talking in the living room before helping them prepare lunch. We cut vegetables, cook rice, and make a salad together. The kitchen smells delicious while the food is cooking. After lunch, we help clean the garden by watering the plants, pulling out weeds, and sweeping the path. Our grandparents tell us stories about their past while we work, and we always learn something new. In the evening, we all sit on the sofa, make some popcorn, and watch a movie together. The day ends with hugs and promises to visit again next weekend.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_03",
    "title": "Grocery shopping",
    "text": "Every Friday afternoon, Lisa goes to the supermarket to buy food for the week. She makes a list at home so she doesn’t forget anything. At the store, she starts in the fruit and vegetable section, choosing fresh apples, bananas, tomatoes, and lettuce. Then she goes to the dairy section to buy milk, cheese, and yogurt. She also picks up some bread and pasta. Sometimes she buys a small treat, like chocolate or cookies. After paying at the cashier, she carefully puts everything into reusable bags. The bags are heavy, so she takes a taxi home. Once she is home, she puts the cold food in the fridge, the dry food in the pantry, and then sits down to have a cup of tea before starting dinner.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_04",
    "title": "Visiting a museum",
    "text": "Last Sunday, David and his sister went to the city museum. They bought tickets at the entrance and were given a small map of the building. First, they visited the art gallery, where they saw paintings from different centuries. David liked the modern art section, while his sister preferred the classical portraits. Next, they went to the history area, where there were old coins, tools, and clothes from many years ago. They took photos of the interesting objects and read the descriptions on the signs. After walking around for two hours, they went to the museum café and had sandwiches and juice. Before leaving, they stopped at the gift shop to buy postcards and a small book about the museum’s collection. It was a fun and educational day.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_05",
    "title": "A day at the beach",
    "text": "In summer, my family and I love going to the beach. We usually leave early in the morning to find a good spot. When we arrive, we put down our towels and open the umbrella for shade. The sun is bright, and the sand is warm under our feet. My brother and I run to the water to swim, while my parents relax and read books. We also build sandcastles and collect seashells along the shore. At lunchtime, we eat sandwiches, fruit, and drink cold water. In the afternoon, we play volleyball with other people on the beach. Before leaving, we take a short walk along the pier to watch the boats. We always return home tired but happy after a long day in the sun.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_06",
    "title": "Cooking dinner",
    "text": "Yesterday evening, Mark decided to cook dinner for his friends. He went to the market in the afternoon to buy fresh ingredients. He bought chicken, potatoes, carrots, onions, and some herbs. At home, he cleaned and cut the vegetables while listening to music. Then he prepared the chicken with olive oil, salt, and pepper, and put everything in the oven. While the food was cooking, he set the table with plates, glasses, and napkins. His friends arrived just as the kitchen started to smell delicious. They sat down together, ate the meal, and talked about their week. After dinner, they enjoyed dessert and washed the dishes together. It was a nice evening full of good food and laughter.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_07",
    "title": "A birthday party",
    "text": "Last month, my cousin had a birthday party at her house. She invited many friends and family members. The living room was decorated with balloons and colorful lights. There was a large table with snacks, sandwiches, and a big chocolate cake. Everyone sang happy birthday, and my cousin made a wish before blowing out the candles. We played games in the garden, took photos, and danced to our favorite songs. Later, we sat in a circle while she opened her presents and thanked everyone. The party ended late in the evening, and everyone left with a small bag of sweets as a gift.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_08",
    "title": "Going hiking",
    "text": "Last weekend, my friends and I went hiking in the mountains. We met early in the morning and drove to the starting point. The weather was sunny, and the air was fresh. We walked along a narrow path surrounded by trees and flowers. Sometimes we stopped to take photos or drink water. After two hours, we reached the top and enjoyed a beautiful view of the valley below. We sat on some rocks to eat our sandwiches and fruit. On the way back, we saw some birds and even a small deer. We arrived home in the afternoon, tired but very happy with our adventure.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_09",
    "title": "Shopping for clothes",
    "text": "Maria needed new clothes for work, so she went shopping in the city center. She visited several stores, looking at dresses, shirts, and shoes. In one store, she tried on a blue dress and liked it, but it was too expensive. She found another dress in a different shop that was cheaper and fit well, so she bought it. She also bought a pair of black shoes and a light jacket. After shopping, she went to a café for a coffee and a slice of cake. She felt satisfied because she found everything she needed without spending too much money.",
    "source": "internal",
    "lang": "en"
  },
  {
    "level": "A2",
    "id": "a2_10",
    "title": "Attending a concert",
    "text": "Two weeks ago, I went to a concert with my best friend. We arrived early to find good seats. The lights were bright, and the atmosphere was full of excitement. When the band came on stage, the crowd started cheering and clapping. They played many popular songs, and we sang along to our favorites. Between songs, the singer talked to the audience and told some funny stories. We took photos and videos to remember the night. The concert lasted for two hours, and at the end, everyone stood up and applauded loudly. It was one of the best concerts I have ever been to.",
    "source": "internal",
    "lang": "en"
  }
]

