[
  {
  "level": "B1",
  "id": "b1_01",
  "title": "Office changes",
  "text": "Our company is moving to a new building next month, and the mood is a mix of excitement and concern. The new offices are more modern and spacious, with larger meeting rooms, better natural light, and a quiet area for focused work. There is also a cafeteria on the ground floor and a small gym that employees can use before or after work. Although the commute will be longer for some colleagues, management has announced flexible hours during the first weeks and a trial shuttle from the nearest train station. Teams have received a packing schedule, and IT will help disconnect and reconnect equipment on moving day. Floor plans were shared by email so everyone can see where their new desks will be. While change can feel uncomfortable, many of us believe the updated facilities will improve collaboration and make daily tasks easier in the long run.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_02",
  "title": "Healthy habits",
  "text": "Experts recommend regular exercise, enough sleep, and a balanced diet, but the challenge is turning these ideas into daily routines. One practical approach is to set small, clear goals: a twenty‑minute walk after lunch, a simple home workout three times a week, and a consistent bedtime. Preparing meals in advance helps you avoid fast food when you are busy, and keeping a water bottle on your desk reminds you to stay hydrated. Reducing screen time before bed and keeping your bedroom dark and quiet can improve sleep quality. It also helps to track your progress in a notebook or an app, because seeing small improvements in energy and concentration can motivate you to continue. Healthy habits do not appear overnight; they grow when you make steady choices and forgive yourself for occasional setbacks.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_03",
  "title": "Hybrid teamwork",
  "text": "Our team now works in a hybrid way, which means some days in the office and some days at home. To keep everyone informed, we start the week with a short online meeting to review goals and deadlines. We use a shared calendar to mark office days, and a chat channel for quick questions. When we write messages, we try to be clear and polite, because tone can be hard to read online. For complex topics, we prefer a short call instead of a long thread. Files are saved in organized folders so anyone can find the latest version. Once a month, we meet in person for a longer workshop to solve problems and build trust. This system is not perfect, but it gives us flexibility while maintaining good communication and steady results.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_04",
  "title": "Taking an online course",
  "text": "Last spring I enrolled in an online course to improve my presentation skills. The platform offered short video lessons, practical exercises, and a forum where students could ask questions. At first, it was difficult to find time after work, so I created a simple plan: thirty minutes of study on weekdays and a longer session on Saturday morning. Recording myself while practicing felt strange, but it helped me notice my posture and the speed of my speech. The instructor gave useful feedback on structure, such as starting with a clear objective and ending with a strong summary. After eight weeks, I gave a presentation at work and received positive comments. The course did not make me perfect, but it gave me tools and confidence to keep improving.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_05",
  "title": "Transport strike",
  "text": "When the city announced a transport strike, many people worried about how to reach their jobs and appointments. Our office created a simple plan: remote work for two days, flexible start times for essential staff, and car‑sharing groups for those who needed to come in. Some colleagues used bicycles for the first time, and others walked part of the way. Meetings were moved online, and we reduced non‑urgent tasks. The situation was not comfortable, but it reminded us that plans can change without warning. After the strike ended, we discussed lessons learned, such as keeping emergency contacts updated and having clear rules for remote access. Being prepared made a stressful week more manageable.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_06",
  "title": "Reducing waste at home",
  "text": "My family decided to reduce waste at home, starting with small actions. We placed separate bins for paper, plastic, glass, and organic waste, and we learned which items can actually be recycled. We also began carrying reusable bags and bottles to avoid single‑use products. Planning meals for the week helped us buy only what we needed and cook leftovers the next day. At first, these habits required extra attention, but soon they became automatic. The kitchen is cleaner, our shopping list is shorter, and we feel better about our impact on the environment. It is encouraging to see that simple, consistent steps can create visible results in a few weeks.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_07",
  "title": "Emergency fund",
  "text": "Last year I started building an emergency fund after a friend lost his job suddenly. I reviewed my monthly expenses and set a realistic target: the cost of three months of rent, food, and basic bills. I opened a separate savings account and transferred a small amount every payday. To make progress faster, I canceled subscriptions I did not use and cooked at home more often. The first months were slow, but the balance grew steadily. When my car needed repairs, I paid from the fund without stress. Having this safety net does not solve every problem, but it gives me peace of mind and space to make better decisions during difficult times.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_08",
  "title": "Weekend city break",
  "text": "My sister and I planned a weekend trip to a nearby city to relax and explore. We booked a small hotel in the center so we could walk to most places. On Saturday morning we visited a museum and joined a short guided tour to understand the main artworks. For lunch we tried a local market with fresh dishes from different stalls. In the afternoon we wandered through narrow streets, stopped at a bookstore, and enjoyed coffee at a quiet café. On Sunday we rented bicycles and followed a river path to a park. Before returning home, we bought a few postcards and a jar of local jam as souvenirs. The trip was short, but it gave us new energy and good memories.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_09",
  "title": "Using new tech responsibly",
  "text": "New apps and tools can make daily tasks easier, but it is important to use them responsibly. When I try a new service, I first read the basic settings and turn off options I do not need, especially those that share data. I choose strong passwords and update them regularly. For work, I discuss new tools with my team so we agree on how to store files and who can access them. Technology should support our goals, not distract us from them. By checking settings, limiting notifications, and organizing our files, we keep the benefits while avoiding common problems like lost documents or constant interruptions.",
  "source": "internal",
  "lang": "en"
  },
  {
  "level": "B1",
  "id": "b1_10",
  "title": "Community clean‑up",
  "text": "Our neighborhood organized a clean‑up day to improve the local park. A small group planned the event, asked the city for bags and gloves, and posted invitations online. On Saturday morning, families, students, and older residents arrived with water bottles and good spirits. We formed teams to collect litter, remove old posters, and clean the benches. Some people planted new flowers near the playground. After two hours, the park looked brighter and more welcoming. We took a group photo and shared it with the community page to thank everyone. The activity was simple, but it created a stronger sense of connection among neighbors and showed how cooperation can change a public space quickly.",
  "source": "internal",
  "lang": "en"
  }
  ]